# AnalyticalEquipmentLoadData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalEquipmentLoadData Members
AnalyticalEquipmentLoadData Class Methods Properties See Also
---
The AnalyticalEquipmentLoadData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from AnalyticalDistributionNodePropertyData.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ApparentLoad | The electrical apparent load of analytical equipment load. |
| Current | The current of the analytical equipment load. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from AnalyticalDistributionNodePropertyData.) |
| LoadClassification | The load classification of analytical equipment load. |
| LoadSet | The electrical analytical load set of the analytical equipment load. |
| LoadType | The load type of analytical equipment load. |
| NumberOfPhases | The number of phases.  (Inherited from AnalyticalDistributionNodePropertyData.) |
| PowerFactor | The power factor of analytical equipment load. |
| TrueLoad | The electrical true load of analytical equipment load. |
| Voltage | The voltage of the analytical equipment load. |

# See Also
AnalyticalEquipmentLoadData Class
Autodesk.Revit.DB.Electrical Namespace